---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.BehaviorType
source: html/f1633ffc-69aa-8337-a0a9-251fca2191a3.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.BehaviorType Property

The behavior type of the pipe fitting or pipe accessory.

## Syntax (C#)
```csharp
public int BehaviorType { get; }
```